---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodPoreType
source: html/c5031cba-d58f-8823-831f-0f55833ce6f4.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodPoreType Property

The property labeled "Pore type" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodPoreType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WoodPoreType".